[
  {
    "name": "Inception",
    "description": "In a world where corporate espionage is carried out through shared dreams, a highly skilled thief is given a final chance at redemption. Instead of stealing information, he must plant an idea deep within the subconscious of his target. As layers of dreams collapse into one another, the line between reality and illusion becomes dangerously blurred.",
    "published_at": "2010-07-16T00:00:00Z",
    "length": 8880000000000,
    "language": "English",
    "genres": ["Sci-Fi", "Thriller"]
  },
  {
    "name": "Interstellar",
    "description": "Facing the collapse of Earth’s ecosystem, a group of astronauts travels through a newly discovered wormhole in search of a habitable planet. As time dilation and cosmic forces take their toll, personal sacrifice becomes inevitable. The story explores love, survival, and humanity’s drive to transcend its limits.",
    "published_at": "2014-11-07T00:00:00Z",
    "length": 10140000000000,
    "language": "English",
    "genres": ["Sci-Fi", "Drama"]
  },
  {
    "name": "The Dark Knight",
    "description": "Batman faces his most dangerous adversary yet when the Joker emerges to plunge Gotham City into chaos. With no clear motive other than anarchy, the Joker forces the city to confront its moral boundaries. The battle becomes less about strength and more about the soul of Gotham itself.",
    "published_at": "2008-07-18T00:00:00Z",
    "length": 9120000000000,
    "language": "English",
    "genres": ["Action", "Crime"]
  },
  {
    "name": "Parasite",
    "description": "A struggling family slowly infiltrates the lives of a wealthy household by posing as unrelated skilled workers. What begins as a clever scheme gradually spirals into a dark and violent confrontation. The film exposes class division and social inequality with biting precision.",
    "published_at": "2019-05-30T00:00:00Z",
    "length": 7920000000000,
    "language": "Korean",
    "genres": ["Drama", "Thriller"]
  },
  {
    "name": "The Shawshank Redemption",
    "description": "Wrongly convicted of murder, a quiet banker is sentenced to life in Shawshank prison. Through patience, intelligence, and quiet resilience, he forms unlikely friendships behind bars. The story is a powerful meditation on hope, dignity, and perseverance.",
    "published_at": "1994-09-23T00:00:00Z",
    "length": 8520000000000,
    "language": "English",
    "genres": ["Drama"]
  },
  {
    "name": "Forrest Gump",
    "description": "Born with limited intellectual abilities, Forrest Gump unintentionally influences several defining moments in American history. Through unwavering optimism and kindness, he navigates love, loss, and success. The film celebrates innocence and the unpredictable nature of life.",
    "published_at": "1994-07-06T00:00:00Z",
    "length": 8520000000000,
    "language": "English",
    "genres": ["Drama", "Romance"]
  },
  {
    "name": "The Matrix",
    "description": "A computer hacker discovers that the reality he knows is a simulated illusion created by intelligent machines. As he joins a group of rebels, he learns the truth about human existence. The film questions free will, identity, and the nature of reality.",
    "published_at": "1999-03-31T00:00:00Z",
    "length": 8160000000000,
    "language": "English",
    "genres": ["Sci-Fi", "Action"]
  },
  {
    "name": "Gladiator",
    "description": "A respected Roman general is betrayed and forced into slavery after the emperor’s murder. Rising through the brutal world of gladiatorial combat, he seeks vengeance and justice. The film portrays honor, power, and sacrifice in ancient Rome.",
    "published_at": "2000-05-05T00:00:00Z",
    "length": 9300000000000,
    "language": "English",
    "genres": ["Action", "Drama"]
  },
  {
    "name": "Whiplash",
    "description": "A young jazz drummer enrolls in a prestigious music conservatory where he encounters a ruthless instructor. Pushed beyond physical and emotional limits, his pursuit of greatness becomes obsessive. The film explores ambition, discipline, and the cost of perfection.",
    "published_at": "2014-10-10T00:00:00Z",
    "length": 6420000000000,
    "language": "English",
    "genres": ["Drama", "Music"]
  },
  {
    "name": "Fight Club",
    "description": "An insomniac office worker forms an underground fight club with a charismatic soap salesman. What begins as an outlet for frustration evolves into a dangerous anti-consumerist movement. The story challenges identity, masculinity, and societal norms.",
    "published_at": "1999-10-15T00:00:00Z",
    "length": 8340000000000,
    "language": "English",
    "genres": ["Drama", "Thriller"]
  },
  {
    "name": "The Godfather",
    "description": "The aging patriarch of a powerful crime family transfers control of his empire to his reluctant son. As loyalty and betrayal intertwine, the family becomes consumed by violence. The film is a definitive exploration of power, tradition, and corruption.",
    "published_at": "1972-03-24T00:00:00Z",
    "length": 10500000000000,
    "language": "English",
    "genres": ["Crime", "Drama"]
  },
  {
    "name": "La La Land",
    "description": "An aspiring actress and a dedicated jazz musician fall in love while pursuing their dreams in Los Angeles. As success pulls them in different directions, they must choose between love and ambition. The film reflects on passion, compromise, and missed opportunities.",
    "published_at": "2016-12-09T00:00:00Z",
    "length": 7680000000000,
    "language": "English",
    "genres": ["Romance", "Music"]
  },
  {
    "name": "Spirited Away",
    "description": "A young girl becomes trapped in a mysterious spirit world after her parents are transformed into pigs. To survive, she must work in a magical bathhouse run by powerful spirits. The film is a richly imaginative journey of courage and self-discovery.",
    "published_at": "2001-07-20T00:00:00Z",
    "length": 7500000000000,
    "language": "Japanese",
    "genres": ["Animation", "Fantasy"]
  },
  {
    "name": "The Silence of the Lambs",
    "description": "A young FBI trainee seeks the help of an imprisoned serial killer to catch another murderer on the loose. Their psychological duel becomes increasingly intense and disturbing. The film blends crime, horror, and psychological tension masterfully.",
    "published_at": "1991-02-14T00:00:00Z",
    "length": 7080000000000,
    "language": "English",
    "genres": ["Crime", "Thriller"]
  },
  {
    "name": "Arrival",
    "description": "When mysterious alien spacecraft land across the globe, a linguist is recruited to communicate with them. As she deciphers their language, her perception of time begins to change. The film explores communication, memory, and the consequences of choice.",
    "published_at": "2016-11-11T00:00:00Z",
    "length": 6960000000000,
    "language": "English",
    "genres": ["Sci-Fi", "Drama"]
  }
]
